src/DataProcessors/ПодборНоменклатурыГосЗакупок/ПодборНоменклатурыГосЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборНоменклатурыГосЗакупок</name>
  <tabularSections>
    <name>ПодобраннаяНоменклатура</name>
    <attributes>
      <name>НоменклатураГосЗакупок</name>
      <type>
        <types>CatalogRef.НоменклатураГосЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияГосЗакупок</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураГосЗакупок</name>
    <attributes>
      <name>НоменклатураГосЗакупок</name>
      <type>
        <types>CatalogRef.НоменклатураГосЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияГосЗакупок</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ПодборНоменклатурыГосЗакупок/Forms/ФормаВводаЦенаКоличество/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "НоменклатураГосЗакупок, ЕдиницаИзмеренияГосЗакупок, КоличествоГосЗакупок, ЦенаГосЗакупок";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если НЕ ЗначениеЗаполнено(НоменклатураГосЗакупок) тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеТабличнойЧасти") тогда
		ДанныеТабличнойЧасти = Параметры.ДанныеТабличнойЧасти;
	КонецЕсли;
	
	СвойстваНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураГосЗакупок, "Наименование, ЕдиницаИзмеренияГосЗакупок");
	
	//Заголовок = СвойстваНоменклатуры.Наименование;
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияГосЗакупок) Тогда
		ЕдиницаИзмеренияГосЗакупок = СвойстваНоменклатуры.ЕдиницаИзмерения;
	КонецЕсли;
	
	МассивДанныеТабличнойЧасти = ДанныеТабличнойЧасти.ВыгрузитьЗначения();
	
	Если ТипЗнч(ДанныеТабличнойЧасти) = Тип("СписокЗначений") тогда
		МассивДанныеТабличнойЧасти = ДанныеТабличнойЧасти.ВыгрузитьЗначения();
		Для Каждого ДанныеСтроки из МассивДанныеТабличнойЧасти цикл
			Если ДанныеСтроки.НоменклатураГосЗакупок = НоменклатураГосЗакупок тогда
				Элементы.ЦенаГосЗакупок.СписокВыбора.Добавить(ДанныеСтроки.ЦенаГосЗакупок,
				                                    "По " + Формат(ДанныеСтроки.ЦенаГосЗакупок,"ЧЦ=15; ЧДЦ=2") +
				                                    " руб., уже введено: " +
													Формат(ДанныеСтроки.КоличествоГосЗакупок, "ЧЦ=15; ЧДЦ=3") +
													" " + Строка(ЕдиницаИзмеренияГосЗакупок));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Элементы.ЦенаГосЗакупок.СписокВыбора.Количество() > 0 тогда
		ЦенаГосЗакупок = Элементы.ЦенаГосЗакупок.СписокВыбора.Получить(0).Значение;
		Элементы.ЦенаГосЗакупок.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	
	Если ЕдиницаИзмеренияГосЗакупок.Дробная тогда
		Элементы.КоличествоГосЗакупок.ФорматРедактирования = "ЧЦ=15; ЧДЦ=3";
	Иначе
		Элементы.КоличествоГосЗакупок.ФорматРедактирования = "ЧЦ=15; ЧДЦ=0";
	КонецЕсли;
	
	ВидСтавкиНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураГосЗакупок, "ВидСтавкиНДС");
	СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС, ТекущаяДата());
	
	Сумма = ЦенаГосЗакупок * КоличествоГосЗакупок;
	
	ТекущийЭлемент = Элементы.КоличествоГосЗакупок;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//МассивНепроверяемыхРеквизитов.Добавить("Количество");
	
	//ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СброситьБыстрыйВыбор()
	
	БыстрыйВвод = Ложь;
	ЭтаФорма.ПоведениеКлавишиEnter = ТипПоведенияКлавишиEnter.ПереходПоЭлементамФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Сумма = ЦенаГосЗакупок * КоличествоГосЗакупок;
	
	ТекущийЭлемент = Элементы.ЦенаГосЗакупок;
	
	Если БыстрыйВвод И ИспользоватьБыстрыйВвод тогда
		ЭтаФорма.ПоведениеКлавишиEnter = ТипПоведенияКлавишиEnter.КнопкаПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Сумма = ЦенаГосЗакупок * КоличествоГосЗакупок;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(КоличествоГосЗакупок) ИЛИ НЕ ЗначениеЗаполнено(ЦенаГосЗакупок) Тогда
		СброситьБыстрыйВыбор();
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура("НоменклатураГосЗакупок, ЕдиницаИзмеренияГосЗакупок,
	                                   |КоличествоГосЗакупок, ЦенаГосЗакупок, СтавкаНДС");
	ЗаполнитьЗначенияСвойств(ПараметрЗакрытия, ЭтотОбъект);
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БыстрыйВвод = Истина;
	ВведеноКоличествоСБыстрымВыбором = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОчистка(Элемент, СтандартнаяОбработка)
		
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
		
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБыстрыйВводПриИзменении(Элемент)
	
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаОчистка(Элемент, СтандартнаяОбработка)
			
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаРегулирование(Элемент, Направление, СтандартнаяОбработка)
			
	СброситьБыстрыйВыбор();
	
КонецПроцедуры
